read_verilog /home/dide/project/Digital-Test/DIDEtemp/user/src/ifft/ifftmain.v
read_verilog /home/dide/project/Digital-Test/DIDEtemp/user/src/ifft/ifftstage.v
read_verilog /home/dide/project/Digital-Test/DIDEtemp/user/src/ifft/hwbfly.v
read_verilog /home/dide/project/Digital-Test/DIDEtemp/user/src/ifft/convround.v
read_verilog /home/dide/project/Digital-Test/DIDEtemp/user/src/ifft/butterfly.v
read_verilog /home/dide/project/Digital-Test/DIDEtemp/user/src/ifft/longbimpy.v
read_verilog /home/dide/project/Digital-Test/DIDEtemp/user/src/ifft/bimpy.v
read_verilog /home/dide/project/Digital-Test/DIDEtemp/user/src/ifft/qtrstage.v
read_verilog /home/dide/project/Digital-Test/DIDEtemp/user/src/ifft/laststage.v
read_verilog /home/dide/project/Digital-Test/DIDEtemp/user/src/ifft/bitreverse.v
synth -top ifftmain
write_json /home/dide/project/yosys/ifft.json
write_verilog -noattr /home/dide/project/yosys/ifft.v
write_edif /home/dide/project/yosys/design.edif